Config/InformationRegisters/EmployeeWorkingTimeSchedule.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>EmployeeWorkingTimeSchedule</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Departments</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Room</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RoomSection</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomSections</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ScheduleDayType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ScheduleDayTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Timetable</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Timetables</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Hours</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/EmployeeWorkingTimeSchedule/Forms/tcRecordForm/Ext/Form/Module.bsl
#Region FormHeaderItemsEventHandlers

// -----------------------------------------------------------------------------
&AtClient
Procedure EmployeeOnChange(pItem)
	EmployeeOnChangeAtServer();
EndProcedure


#EndRegion

#Region Private

// -----------------------------------------------------------------------------
&AtServer
Procedure EmployeeOnChangeAtServer()
	If ValueIsFilled(Record.Employee) Then
		If Not ValueIsFilled(Record.Department) Then
			Record.Department = Record.Employee.Department;
		EndIf;
		If Not ValueIsFilled(Record.RoomSection) Then
			Record.RoomSection = Record.Employee.RoomSection;
		EndIf;
		If Not ValueIsFilled(Record.Hotel) Then
			If ValueIsFilled(Record.Employee.Hotel) Then
				Record.Hotel = Record.Employee.Hotel;
			Else
				Record.Hotel = SessionParameters.CurrentHotel;
			EndIf;
		EndIf;
	EndIf; 
EndProcedure

#EndRegion
